Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The sonar, server, database, and project blocks in the examples above configure objects of type SonarRootModel, SonarServer, SonarDatabase, and SonarProject, respectively.
zh_cn: 在上面的例子中，sonar，server，database和project 块分别配置的是SonarRootModel， SonarServer， SonarDatabase及 SonarProject类型的对象。

source: The sonarAnalyze task is a standalone task that needs to be executed explicitly and doesn't depend on any other tasks.
zh_cn: SonarAnalyze task 是一项需要显式执行的独立任务，不依赖于任何其他 task。

source: The test task is an instance of Test.
zh_cn: test任务是Test的一个实例。

source: The testLogging property allows to configure which test events are going to be logged and at which detail level.
zh_cn: testLogging属性可以配置哪些测试事件需要记录，并且使用什么样的日志级别。

source: The whenMerged hook allows to manipulate the fully populated domain objects.
zh_cn: WhenMerged hook 允许操作完全填充的域对象。

source: The whenMerged hook is executed with a domain object representing contents of the file to be persisted
zh_cn: whenMerged的 hook 会随着一个表示持久化的域对象执行

source: The withXml hook is executed with a raw representation of the XML that will be persisted
zh_cn: withXml的 hook 会随着一个表示将被持久化的XML的 raw 执行

source: The withXmlhook allows to manipulate the in-memory XML representation just before the file gets written to disk.
zh_cn: WithXml hook 允许在文件写入到磁盘之前，操纵内存中的 XML 的表示形式。

source: The -D option of the gradle command has the same effect as the -D option of the java command.
zh_cn: Gradle命令的-D选项和java命令的-D选项有着同样的效果。

source: The archives configuration is the standard configuration to assign your artifacts to.
zh_cn: archives 配置是一个指定你的构件的标准配置。

source: The beforeMerged hook makes it possible to overwrite just certain parts of the existing content.
zh_cn: beforeMerged hook 可以实现只覆盖现有的某些部分的内容。

source: The buildNeeded and buildDependents tasks can help with this.
zh_cn: buildNeeded 和 buildDependents 任务能帮你做到这一点。

source: The compile configuration inherits this dependency, so the groovy libraries will be included in classpath when compiling Groovy and Java source.
zh_cn: 编译 配置继承了这个依赖,从而在编译Groovy和Java源代码时，groovy库也会被包含在类路径中。

source: The copy() method can be used to copy files as part of a task's implementation.
zh_cn: copy()方法可以作为一个任务执行的部分来复制文件。

source: The copyRecursive method copies all the dependencies, including the dependencies from extended configurations.
zh_cn: copyRecursive方法将复制所有依赖，包括扩展配置的依赖。

source: The settings.xml in USER_HOME/.m2 takes precedence over the settings.xml in M2_HOME/conf.
zh_cn: 在USER_HOME/.m2 的settings.xml 比在 M2_HOME/conf的settings.xml优先。

source: The main source set contains your production source code, which is compiled and assembled into a JAR file.
zh_cn: main源集包含你产品的源代码，它们将被编译并组装成一个 JAR 文件。

source: The FileTree interface extends FileCollection, so you can treat a file tree exactly the same way as you would a file collection.
zh_cn: FileTree接口继承自FileCollection，所以你可以用对待文件集合一样的方式来对待文件树。

source: The into() accepts any of the arguments that the file() method does.
zh_cn: into()方法接受和files()方法一样的任何参数。

source: The test source set contains your unit test source code, which is compiled and executed using JUnit or TestNG.
zh_cn: test源集包含你的单元测试的源代码，它们将被编译并使用 JUnit 或 TestNG来执行。

source: The Copy task implements this interface.
zh_cn: Copy任务实现了此接口。

source: The dependency elements are created from the project's dependency declarations.
zh_cn: 这些dependency元素由project 的依赖声明所创建。

source: The files() method accepts any type of object as its parameters.
zh_cn: 这个Files()方法接受任何类型的对象作为其参数。

source: The files method therefore returns seal-2.0 as a transitive dependency oforca.
zh_cn: files 方法因此返回 seal-2.0 作为 orca的传递依赖。

source: The GroovyCompile task supports most configuration options of the official Groovy compiler.
zh_cn: GroovyCompile task 支持官方的 Groovy 编译器的大多数配置选项。

source: The file() method also understands URLs, such as file:/some/path.xml.
zh_cn: 这个file ()方法也可以识别URL，例如是file:/some/path.xml。

source: The taskName can be a full multi-project path like ":sub1:sub2:test" or just the task name.
zh_cn: 这个taskName 可以是一个完整的多项目路径，比如“sub1:sub2:test”，或者仅是一个任务名称。

source: The testNamePattern will be used to form an include pattern of "**/testNamePattern*.class".
zh_cn: testNamePattern将用于形成一个“**/testNamePattern*.class”的包含模式。

source: The absence of a particular module or artifact in a particular repository, eliminating repeated attempts to access a resource that does not exist.
zh_cn: 在特定的仓库中缺少的特定模块或工件，避免反复地尝试访问不存在的资源。

source: The execution dependency is in the other direction, as webDist depends on the build artifacts of date and hello.
zh_cn: 执行依赖则是另一个方面，因为webDist依赖于date 和 hello所构建的构件。

source: The ANTLR grammar files of this source set.
zh_cn: 给定的source set 的 ANTLR 语法文件。

source: The ANTLR plugin adds a number of tasks to your project, as shown below.
zh_cn: ANTLR 插件向你的项目添加了大量的任务，如下所示。

source: The ANTLR plugin adds an antlr dependency configuration.
zh_cn: ANTLR 插件添加了一个 antlr 的依赖配置：

source: The ANTLR plugin adds the following dependencies to tasks added by the Java plugin.
zh_cn: ANTLR 插件向 Java 插件所加入的 tasks 添加了以下的依赖。

source: The ANTLR plugin adds the following properties to each source set in the project.
zh_cn: ANTLR 插件向 project 的每一个source set 添加了下列属性。

source: The ANTLR plugin does not add any convention properties.
zh_cn: ANTLR 插件不会添加任何约定属性。

source: The ANTLR plugin extends the Java plugin to add support for generating parsers using ANTLR.
zh_cn: ANTLR 插件扩展自 Java 插件并添加了使用 ANTLR 生成语法分析器的支持。

source: The ANTLR plugin only supports ANTLR version 2.
zh_cn: ANTLR 插件只支持 ANTLR 版本 2。

source: The API lets you to walk the resolved dependency graph and provides information about the dependencies.
zh_cn: 这个 API 可以让你查看解析的依赖图，并提供有关依赖的信息。

source: The Ant based compiler (scalaCompileOptions.useAnt = true) will fork a new process for every ScalaCompile task, and does not fork by default.
zh_cn: 基于 Ant 的编译器 (scalaCompileOptions.useAnt = true) 将为每个ScalaCompile任务fork 一个新进程，而默认情况下它不进行fork。

source: The Ant integration is provided by AntBuilder.
zh_cn: Ant 集成由AntBuilder提供。

source: The Ant properties are also available as a Map which you can change.
zh_cn: Ant 属性也可以从一个你可以修改的Map中获得。

source: The Ant properties are also available as a Map.
zh_cn: Ant 属性也可作为一个 Map。

source: The Application plugin adds the following tasks to the project.
zh_cn: 应用程序插件向 project 中添加了以下任务。

source: The Build Dashboard plugin adds the following task to the project:
zh_cn: Build Dashboard 插件向项目中添加以下任务：

source: The Build Dashboard plugin can be used to generate a single HTML dashboard that provides a single point of access to all of the reports generated by a build.
zh_cn: Build Dashboard 插件可以用于生成单个 HTML dashboard，提供对由构建生成的所有报告的单点访问。

source: The Build Dashboard plugin does not define any dependency configurations.
zh_cn: Build Dashboard 插件没有定义任何的依赖配置。

source: The Build Dashboard plugin does not require any particular project layout.
zh_cn: Build Dashboard 插件不需要任何特定的项目布局。

source: The Build Environment
zh_cn: 构建环境

source: The Build Init plugin is an automatically applied plugin, which means you do not need to apply it explicitly.
zh_cn: Build Init 插件是一个自动应用的插件，这意味着您不需要显式地应用它。

source: The Build Init plugin is currently incubating.
zh_cn: Build Init 插件目前仍然是孵化状态。

source: The Checkstyle Plugin
zh_cn: Checkstyle 插件

source: The Checkstyle libraries to use
zh_cn: 用到的 Checkstyle 库

source: The Checkstyle plugin adds the following dependencies to tasks defined by the Java plugin.
zh_cn: Checkstyle 插件向 Java 插件所加入的 tasks 添加了以下的依赖。

source: The Checkstyle plugin adds the following dependency configurations:
zh_cn: Checkstyle 插件添加了下列的依赖配置：

source: The Checkstyle plugin adds the following tasks to the project:
zh_cn: Checkstyle 插件向project 中添加了以下tasks：

source: The Checkstyle plugin expects the following project layout:
zh_cn: Checkstyle 插件预计是以下的项目布局：

source: The Checkstyle plugin performs quality checks on your project's Java source files using Checkstyle and generates reports from these checks.
zh_cn: Checkstyle 插件使用Checkstyle对你的项目的 Java 源文件执行质量检查，并从检查结果中生成报告。

source: The CodeNarc Plugin
zh_cn: CodeNarc 插件

source: The CodeNarc libraries to use
zh_cn: 使用的 CodeNarc 库

source: The CodeNarc plugin adds the following dependencies to tasks defined by the Groovy plugin.
zh_cn: CodeNarc 插件向 Groovy 插件所加入的任务添加了以下的依赖。

source: The CodeNarc plugin adds the following dependency configurations:
zh_cn: CodeNarc 插件添加了下列的依赖配置：

source: The CodeNarc plugin adds the following tasks to the project:
zh_cn: CodeNarc 插件向project 中添加了以下任务：

source: The CodeNarc plugin expects the following project layout:
zh_cn: CodeNarc 插件预计是以下的项目布局：

source: The CodeNarc plugin performs quality checks on your project's Groovy source files using CodeNarc and generates reports from these checks.
zh_cn: CodeNarc 插件使用CodeNarc对项目的 Groovy 源文件执行质量检查并生成报告。

source: The Command Line tab is place to execute a single Gradle command directly.
zh_cn: 命令行选项卡是直接执行单个的 Gradle 命令的地方。

source: The Distribution plugin adds the following tasks to the project:
zh_cn: 分发插件向 project 中添加了以下任务：

source: The Ear Plugin
zh_cn: Ear 插件

source: The Ear plugin adds support for assembling web application EAR files.
zh_cn: Ear 插件添加了用于组装 web 应用程序的 EAR 文件的支持。

source: The Ear plugin adds the following dependencies to tasks added by the base plugin.
zh_cn: Ear 插件向基础插件所加入的 tasks 添加了以下的依赖。

source: The Ear plugin adds the following tasks to the project.
zh_cn: Ear 插件向project 中添加了以下任务。

source: The Ear plugin adds two dependency configurations: deploy and earlib.
zh_cn: Ear 插件添加了两个依赖配置：deploy和earlib。

source: The Eclipse plugin adds a number of tasks to your projects.
zh_cn: Eclipse 插件向你的projects 添加了大量的任务。

source: The Eclipse plugin adds the tasks shown below to a project.
zh_cn: Eclipse 插件向一个 project 添加了如下所示的任务。

source: The Eclipse plugin allows you to customize the generated metadata files.
zh_cn: Eclipse 插件允许您自定义生成的元数据文件。

source: The Eclipse plugin generates files that are used by the Eclipse IDE, thus making it possible to import the project into Eclipse (File - Import... - Existing Projects into Workspace).
zh_cn: Eclipse 插件生成Eclipse IDE所使用的文件，从而让项目能够导入 Eclipse （File - Import... - Existing Projects into Workspace）。

source: The Eclipse plugin is open to customization and provides a standardized set of hooks for adding and removing content from the generated files.
zh_cn: Eclipse 插件是开放的，以定制和提供一套标准化的钩，用于添加和删除生成的文件的内容。

source: The Eclipse plugin provides objects modeling the sections of the Eclipse files that are generated by Gradle.
zh_cn: Eclipse 插件提供了一些对象，对由 Gradle 生成的 Eclipse 文件的段落进行建模。

source: The Favorites tab is place to store commonly-executed commands.
zh_cn: 收藏夹选项卡用来储存经常执行的命令。

source: The FindBugs libraries to use
zh_cn: 使用的 FindBugs 库

source: The FindBugs plugin adds the following dependencies to tasks defined by the Java plugin.
zh_cn: FindBugs 插件向 Java 插件所加入的任务添加了以下的依赖。

source: The FindBugs plugin adds the following dependency configurations:
zh_cn: FindBugs 插件增加了下列的依赖配置：

source: The FindBugs plugin adds the following tasks to the project:
zh_cn: FindBugs 插件向project 中添加了以下任务：

source: The FindBugs plugin performs quality checks on your project's Java source files using FindBugs and generates reports from these checks.
zh_cn: FindBugs 插件使用FindBugs对项目的 Java 源文件执行质量检查，并从检查结果中生成报告。

source: The Gradle cunit plugin provides support for compiling and executing CUnit tests in your native-binary project.
zh_cn: Gradle cunit 插件向你的native-binary项目提供了编译及执行CUnit 测试的支持。

source: The Gradle Build Init plugin can be used to bootstrap the process of creating a new Gradle build.
zh_cn: Gradle Build Init 插件可以用于引导创建一个新的 Gradle 构建的过程。

source: The Gradle DSL uses closures in many places.
zh_cn: Gradle DSL 在很多地方使用闭包。

source: The Gradle Daemon
zh_cn: Gradle 守护进程

source: The Gradle announce allows to send custom announcements during a build.
zh_cn: Gradle 宣布允许在构建期间发送自定义公告。

source: The Gradle application plugin extends the language plugins with common application related tasks.
zh_cn: Gradle 应用程序插件扩展了语言插件的一些常见应用程序相关的任务。

source: The Gradle build language
zh_cn: Gradle 构建语言

source: The Gradle cache does not allow the local cache to hide problems and creating mysterious and difficult to debug behavior that has been a challenge with many build tools.
zh_cn: Gradle 缓存中不允许本地缓存隐藏问题和，以及一直是许多构建工具的挑战的创造神秘及难以调试的行为。

source: The Gradle dependency cache consists of 2 key types of storage:
zh_cn: Gradle 依赖缓存包含 2 个主要类型的存储：

source: The Gradle dependency cache uses file-based locking to ensure that it can safely be used by multiple Gradle processes concurrently.
zh_cn: Gradle 依赖缓存使用基于文件的锁来确保，它可以安全地通过多个 Gradle 进程并行使用。

source: The Gradle support for building native binaries is currently incubating.
zh_cn: Gradle 对构建原生二进制文件的支持目前还是孵化阶段。

source: The Gradle wrapper plugin allows the generation of Gradle wrapper files by adding a Wrapper task, that generates all files needed to run the build using the Gradle Wrapper.
zh_cn: Gradle wrapper 插件允许通过添加 Wrapper任务生成的 Gradle wrapper 文件，来生成使用 Gradle Wrapper 运行构建时所需的所有文件。

source: The Groovy Plugin
zh_cn: Groovy 插件

source: The Groovy library doesn't necessarily have to come from a remote repository.
zh_cn: Groovy 库不一定得从远程仓库中获取。

source: The Groovy plugin adds a GroovyCompile task for each source set in the project.
zh_cn: Java 插件向 project 里的每个source set 添加了一个JavaCompile task。

source: The Groovy plugin adds the following convention properties to each source set in the project.
zh_cn: Groovy 的插件向 project 的每一个source set 添加了下列的常规属性。

source: The Groovy plugin adds the following dependencies to tasks added by the Java plugin.
zh_cn: Groovy 的插件向 Java 插件所加入的 tasks 添加了以下的依赖。

source: The Groovy plugin adds the following tasks to the project.
zh_cn: Groovy 的插件向project 中添加了以下任务。

source: The Groovy plugin also modifies some source set properties:
zh_cn: Groovy 的插件还修改了一些 source set 的属性：

source: The Groovy plugin assumes the project layout shown in Table 24.3, “Groovy plugin - project layout”.
zh_cn: Groovy 的插件会假定项目的布局如表 24.3，“Groovy 插件 - 项目布局”中所示。

source: The Groovy plugin does not add any convention properties to the project.
zh_cn: Groovy 的插件没有向 project 添加任何的常规属性。

source: The Groovy plugin extends the compile task to look for source files in directory src/main/groovy, and the compileTest task to look for test source files in directory src/test/groovy.
zh_cn: Groovy插件继承了 compile task ， src/main/groovy目录中查找源文件；还有 compileTest task，在src/test/groovy目录中查找测试的源文件。

source: The Groovy plugin extends the Java plugin to add support for Groovy projects.
zh_cn: Groovy 的插件继承自 Java 插件并添加了对 Groovy 项目的支持。

source: The Groovy source files of this source set.
zh_cn: 该source set 中的 Groovy 源文件。

source: The IDEA plugin adds a number of tasks to your project.
zh_cn: IDEA 插件向你的project 添加了大量的任务。

source: The IDEA plugin adds the tasks shown below to a project.
zh_cn: IDEA 插件向一个 project 添加了如下所示的任务。

source: The IDEA plugin generates files that are used by IntelliJ IDEA, thus making it possible to open the project from IDEA (File - Open Project).
zh_cn: IDEA 插件生成IntelliJ IDEA所使用的文件，从而让项目能够在 IDEA 中打开 （File - Open Project）。

source: The JAR file is declared as an artifact in the archives dependency configuration.
zh_cn: JAR 文件在archives依赖配置中被声明为一个构件。

source: The JDepend libraries to use
zh_cn: 使用的 JDepend 库

source: The JDepend plugin adds the following dependencies to tasks defined by the Java plugin.
zh_cn: JDepend 插件向 Java 插件所加入的任务添加了以下的依赖。

source: The JDepend plugin adds the following dependency configurations:
zh_cn: JDepend 插件添加了下列的依赖配置：

source: The JDepend plugin adds the following tasks to the project:
zh_cn: JDepend 插件向project 中添加了以下任务：

source: The JDepend plugin performs quality checks on your project's source files using JDepend and generates reports from these checks.
zh_cn: JDepend 插件使用JDepend对项目的源文件执行质量检查，并从检查结果中生成报告。

source: The JaCoCo Ant library used for running the JacocoReport and JacocoMerge tasks.
zh_cn: 用于运行JacocoReport和JacocoMerge任务的 JaCoCo Ant 库。

source: The JaCoCo agent library used for instrumenting the code under test.
zh_cn: 用于测试位于test下的代码的 JaCoCo 客户端库。

source: The JaCoCo plugin adds a JacocoTaskExtension extension to all tasks of type Test.
zh_cn: JaCoCo 插件添加了一个JacocoTaskExtension扩展到Test类型的所有任务中。

source: The JaCoCo plugin adds a project extension named jacoco of type JacocoPluginExtension, which allows configuring defaults for JaCoCo usage in your build.
zh_cn: JaCoCo 插件添加一个名为jacoco类型为JacocoPluginExtension的project 扩展，这个扩展允许在你的构建中配置 JaCoCo 所使用的默认值。

source: The JaCoCo plugin adds the following dependency configurations:
zh_cn: JaCoCo 插件添加了下列的依赖配置：

source: The JaCoCo plugin is currently incubating.
zh_cn: JaCoCo 插件目前还是孵化中状态。

source: The JaCoCo plugin provides code coverage metrics for Java code via integration with JaCoCo.
zh_cn: JaCoCo 插件通过集成JaCoCo为 Java 代码提供了代码覆盖率指标。

source: The Java Plugin
zh_cn: Java 插件

source: The Java library distribution plugin adds support for building a distribution ZIP for a Java library.
zh_cn: Java 库分布插件为一个 Java library 添加了构建一个分发 ZIP 的支持。

source: The Java library distribution plugin adds the following tasks to the project.
zh_cn: Java 库分发插件向 project 对象添加以下任务。

source: The Java library distribution plugin is currently incubating.
zh_cn: Java 库发布插件目前还处于孵化中。

source: The Java plugin
zh_cn: Java 插件

source: The Java plugin adds Java compilation, testing and bundling capabilities to a project.
zh_cn: Java 插件向project 添加了 Java 编译、 测试和捆绑的能力。

source: The Java plugin adds a JavaCompile instance for each source set in the project.
zh_cn: Java 插件为该project里的每个源集添加一个JavaCompile实例。

source: The Java plugin adds a runtime configuration for this purpose, with the implicit assumption that the runtime dependencies are the dependencies of the artifact you want to publish.
zh_cn: Java 插件已经为此添加了一个runtime配置，它隐式的假设runtime依赖项是你想要发布的构件的依赖。

source: The Java plugin adds a number of convention properties to the project, shown below.
zh_cn: Java插件向项目添加了许多常规属性，如下图所示。

source: The Java plugin adds a number of default values for the archive tasks.
zh_cn: Java 插件对归档任务添加了一些默认值。

source: The Java plugin adds a number of dependency configurations to your project, as shown below.
zh_cn: Java插件向项目添加了许多依赖配置，如下图所示。

source: The Java plugin adds a number of tasks to your project, as shown below.
zh_cn: Java 插件向你的项目添加了大量的任务，如下所示。

source: The Java plugin adds per default a jar to your project libraries which contains all the classes.
zh_cn: Java 插件向你的项目的每个库添加了一个默认的jar，它包含了所有类。

source: The Java plugin adds the concept of source sets (see SourceSet) to describe the aspects of a set of source, one aspect being where the class files should be written to when it is compiled.
zh_cn: Java 插件添加了 source sets 的概念 （见SourceSet） 来描述的源文件集的各个方面，其中一个方面是在编译的时候这些类文件应该被写到哪个地方。

source: The Java plugin also adds a number of tasks which assemble the classes for the source set, as shown in Table 23.2, “Java plugin - source set tasks”.
zh_cn: Java 插件还添加了大量的任务，用于组装源集的类，如表 23.2，“Java 插件 - 源设置任务”所示。

source: The Java plugin also adds a number of tasks which form a lifecycle for the project:
zh_cn: Java 插件还增加了大量的任务构成该项目的生命周期：

source: The Java plugin assumes the project layout shown below.
zh_cn: Java 插件会假定如下所示的项目布局。

source: The Java plugin automatically assigns the default jar to this configuration.
zh_cn: Java 插件会自动地把默认的 jar 文件指定到这个配置中。

source: The Java plugin defaults this property to point to build/classes/main in the project directory.
zh_cn: Java 插件默认此属性指向项目目录中的build/classes/main。

source: The Java plugin defines two standard source sets, called main and test.
zh_cn: Java 插件定义了两个标准的源集，分别是main和test。

source: The Java plugin has added a compileJava task and a processResources task to the project and configured the destinationDir property of both of these tasks.
zh_cn: Java 插件已经向项目添加了 compileJava任务和processResources任务，并且配置了这两个任务的destinationDir属性。

source: The Java plugin introduces the concept of a source set.
zh_cn: Java 插件引入了一个源集的概念。

source: The Java plugin maps the destinationDir property of the compileJava task to this aspect of the source set.
zh_cn: Java 插件将compileJava任务的destinationDir属性映射到源文件集的这一个方面。

source: The Java plugin uses the Copy task for resource handling.
zh_cn: Java 插件使用Copy任务进行资源的处理。

source: The Java plugin will compile whatever it finds, and handles anything which is missing.
zh_cn: Java插件将会进行编译，不管它发现什么，并处理缺少的任何东西。

source: The Java plugin, for example, adds some configurations to represent the various classpaths it needs.
zh_cn: 例如，Java 插件会添加一些配置来表示它所需要的不同的类路径。

source: The Java source directories may only contain Java source code.
zh_cn: Java 源目录只能包含 Java 源代码。

source: The Java source files of this source set.
zh_cn: 该源集的Java源文件。

source: The Jetty Plugin
zh_cn: Jetty 插件

source: The Jetty plugin defines the following convention properties:
zh_cn: Jetty 插件定义了下列公约属性：

source: The Jetty plugin defines the following tasks:
zh_cn: Jetty 插件定义了以下任务：

source: The Jetty plugin does not define any dependency configurations.
zh_cn: Jetty 插件并不定义任何依赖配置。

source: The Jetty plugin extends the War plugin to add tasks which allow you to deploy your web application to a Jetty web container embedded in the build.
zh_cn: Jetty 插件继承自 War 插件，并添加一些任务，这些任务可以让你在构建时部署你的 web 应用程序到一个 Jetty 的 web 嵌入式容器中。

source: The Jetty plugin extends the War plugin to allow you to deploy your web application to an embedded Jetty web container.
zh_cn: Jetty插件扩展了War插件以允许你部署你的web应用程序到嵌入式Jetty web窗口中。

source: The Jetty plugin uses the same layout as the War plugin.
zh_cn: Jetty 插件使用 和 War 插件相同的布局。

source: The Maven Central repository can be down or has a very long response time.
zh_cn: Maven 中央存储库可能会下线，或者响应时间很长。

source: The Maven conversion implementation was inspired by the maven2gradle tool that was originally developed by Gradle community members.
zh_cn: Maven 转换实现最初由 Gradle 社区成员开发的maven2gradle tool启发。

source: The Maven dependency management has the notion of classifiers.
zh_cn: Maven 依赖管理有 classifier 的概念。

source: The Maven plugin adds an install task to your project.
zh_cn: Maven 插件将install任务添加到你的项目。

source: The Maven plugin adds support for deploying artifacts to Maven repositories.
zh_cn: Maven 插件添加了将项目部署到 Maven 仓库的支持。

source: The Maven plugin configures the default mapping between the Gradle configurations added by the Java and War plugin and the Maven scopes.
zh_cn: Maven 插件配置了由Java插件和War插件添加的Gradle configurations 与Maven scopes之间的默认映射。

source: The Maven plugin defines the following convention properties:
zh_cn: Maven 插件定义了下列约定属性：

source: The Maven plugin defines the following tasks:
zh_cn: Maven 插件定义了以下任务：

source: The Maven plugin does not define any dependency configurations.
zh_cn: Maven 插件不定义任何依赖配置。

source: The OSGi plugin adds the following convention object: OsgiPluginConvention
zh_cn: OSGi 插件添加了下列约定对象： OsgiPluginConvention

source: The OSGi plugin adds the following methods.
zh_cn: OSGi 插件添加了以下方法。

source: The OSGi plugin does not add any convention properties to the project.
zh_cn: OSGi 插件没有向 project 添加任何的公约属性。

source: The OSGi plugin makes heavy use of Peter Kriens BND tool.
zh_cn: OSGi 插件使 Peter Kriens BND tool 大量使用。

source: The OSGi plugin provides a factory method to create an OsgiManifest object.
zh_cn: OSGi 插件提供了工厂方法来创建一个OsgiManifest对象。

source: The PMD libraries to use
zh_cn: 使用的 PMD 库

source: The PMD plugin adds the following dependencies to tasks defined by the Java plugin.
zh_cn: PMD 插件向 Java 插件所加入的任务添加了以下的依赖。

source: The PMD plugin adds the following dependency configurations:
zh_cn: PMD 插件添加了下列的依赖配置：

source: The PMD plugin adds the following tasks to the project:
zh_cn: PMD 插件向project 中添加了以下任务：

source: The PMD plugin performs quality checks on your project's Java source files using PMD and generates reports from these checks.
zh_cn: PMD 插件使用PMD对项目的 Java 源文件执行质量检查，并从检查结果中生成报告。

source: The POM files of many projects have wrong information (as one example, the POM of commons-httpclient-3.0 declares JUnit as a runtime dependency).
zh_cn: 许多项目的 POM 文件会有错误的信息（比如，commons-httpclient-3.0的POM文件声明了 JUnit 是运行时依赖）。
